traces/05-create.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:addata="http://schemas.microsoft.com/2008/1/ActiveDirectory/Data" xmlns:ad="http://schemas.microsoft.com/2008/1/ActiveDirectory" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:da="http://schemas.microsoft.com/2006/11/IdentityManagement/DirectoryAccess">
<s:Header>
<a:Action s:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2004/09/transfer/Create</a:Action>
<ad:instance>ldap:389</ad:instance>
<da:IdentityManagementOperation s:mustUnderstand="1" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"></da:IdentityManagementOperation>
<a:MessageID>urn:uuid:10faa255-55db-43a7-951b-bb1f2d20d3bd</a:MessageID>
<a:ReplyTo>
<a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
</a:ReplyTo>
<a:To s:mustUnderstand="1">net.tcp://win2016.ad.garming.example.com:9389/ActiveDirectoryWebServices/Windows/ResourceFactory</a:To>
</s:Header>
<s:Body>
<da:AddRequest Dialect="http://schemas.microsoft.com/2008/1/ActiveDirectory/Dialect/XPath-Level-1">
<da:AttributeTypeAndValue>
<da:AttributeType>addata:objectClass</da:AttributeType>
<da:AttributeValue>
<ad:value xsi:type="xsd:string">User</ad:value>
</da:AttributeValue>
</da:AttributeTypeAndValue>
<da:AttributeTypeAndValue>
<da:AttributeType>ad:relativeDistinguishedName</da:AttributeType>
<da:AttributeValue>
<ad:value xsi:type="xsd:string">cn=testuser</ad:value>
</da:AttributeValue>
</da:AttributeTypeAndValue>
<da:AttributeTypeAndValue>
<da:AttributeType>ad:container-hierarchy-parent</da:AttributeType>
<da:AttributeValue>
<ad:value xsi:type="xsd:string">DC=ad,DC=garming,DC=example,DC=com</ad:value>
</da:AttributeValue>
</da:AttributeTypeAndValue>
<ad:controls>
<ad:control type="1.2.840.113556.1.4.801" criticality="true">
<ad:controlValue xsi:type="xsd:base64Binary">MIQAAAADAgEE</ad:controlValue>
</ad:control>
</ad:controls>
</da:AddRequest>
</s:Body>
</s:Envelope>
